export default [
    {
        version: "v1.1.1",
        date: "2026-03-03",
        changes: ["背包添加道具使用和丢弃功能，然后添加了许多局内道具、永久道具", "数据清晰化，让你更容易作弊🤣，但是如果这样都不会修改，那就给我老老实实“绿玩”！"],
    },
    {
        version: "v1.1.0",
        date: "2026-03-02",
        changes: ["关卡功能完善", "稍微添加了非常简单的防作弊功能，鼓励玩家尽可能不要作弊，当然其实还是非常容易作弊的，只是尽可能鼓励", "清除部分无用代码"],
    },
    {
        version: "v1.0.5",
        date: "2026-02-28",
        changes: ["修复对局功能角色初始化问题", "添加备战功能，只是制作了弹框，功能尚未加入对局流程中", "修改存档的一些逻辑，后续再接着完善存档功能"],
    },
    {
        version: "v1.0.4",
        date: "2026-02-24",
        changes: ["对局功能正式完成，但仍然需要进一步测试", "引入并使用 terser，减少打包体积，但代码可能变得更难阅读，有需要的话再关闭吧，懒得改了"],
    },
    {
        version: "v1.0.3",
        date: "2026-02-23",
        changes: ["添加抽卡功能", "对局战场仍然在测试中"],
    },
    {
        version: "v1.0.2",
        date: "2026-02-21",
        changes: ["千禧完成图鉴和商城功能", "物品及其效果待添加"],
    },
    {
        version: "v1.0.1",
        date: "2026-02-17",
        changes: ["初步创建千禧梦模式", "空白模式框架搭建"],
    },
    {
        version: "v1.0.0",
        date: "2026-02-15",
        changes: ["扩展创建和初始化", "空白扩展框架搭建"],
    },
];
